#+TITLE: November 28, 2019 - December 11, 2019 (14 days)
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2019-11-28 Thu>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-kurianbenoy: 1.5
  :wpd-sandeepk: 1.2
  :END:
** akshay196
*** IN_PROGRESS Test-Driven Development with Python - Part II [5/16]
    :PROPERTIES:
    :ESTIMATED: 14
    :ACTUAL:   5.53
    :OWNER: akshay196
    :ID: READ.1573574122
    :TASKID: READ.1573574122
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-05 Thu 08:39]--[2019-12-05 Thu 09:23] =>  0:44
    CLOCK: [2019-12-04 Wed 20:40]--[2019-12-04 Wed 21:41] =>  1:01
    CLOCK: [2019-12-03 Tue 09:02]--[2019-12-03 Tue 09:48] =>  0:46
    CLOCK: [2019-12-02 Mon 08:39]--[2019-12-02 Mon 09:45] =>  1:06
    CLOCK: [2019-11-30 Sat 09:43]--[2019-11-30 Sat 11:02] =>  1:19
    CLOCK: [2019-11-29 Fri 08:22]--[2019-11-29 Fri 08:58] =>  0:36
    :END:
    - [X] Chapter 11. Automating Deployment with Fabric                                             (30m)
    - [X] Chapter 12. Splitting Our Tests into Multiple Files, and a Generic Wait Helper            (30m)
    - [X] Chapter 13. Validation at the Database Layer                                              ( 1h)
    - [X] Chapter 14. A Simple Form                                                                 ( 1h)
    - [X] Chapter 15. More Advanced Forms                                                           ( 1h)
    - [ ] Chapter 16. Dipping Our Toes, Very Tentatively, into JavaScript                           ( 1h)
    - [ ] Chapter 17. Deploying Our New Code                                                        (30m)
    - [ ] Chapter 18. User Authentication, Spiking, and De-Spiking                                  ( 1h)
    - [ ] Chapter 19. Using Mocks to Test External Dependencies or Reduce Duplication               ( 1h)
    - [ ] Chapter 20. Test Fixtures and a Decorator for Explicit Waits                              (30m)
    - [ ] Chapter 21. Server-Side Debugging                                                         ( 1h)
    - [ ] Chapter 22. Finishing "My Lists": Outside-In TDD                                          ( 1h)
    - [ ] Chapter 23. Test Isolation, and "Listening to Your Tests"                                 ( 1h)
    - [ ] Chapter 24. Continuous Integration (CI)                                                   ( 1h)
    - [ ] Chapter 25. The Token Social Bit, the Page Pattern, and an Exercise for the Reader        ( 1h)
    - [ ] Chapter 26. Fast Tests, Slow Tests, and Hot Lava                                          ( 1h)
** bhavin192
*** Certified Kubernetes Application Developer exam [0/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       OPS.1575116208
    :TASKID:   OPS.1575116208
    :END:
     https://www.cncf.io/certification/ckad/
     - [ ] Practice	 (2h)
     - [ ] Exam		 (2h)
*** Watch EmacsConf 2019 videos [0/14]
    :PROPERTIES:
    :ESTIMATED: 4.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1575285614
    :TASKID:   READ.1575285614
    :END:
    - [ ] [[https://media.emacsconf.org/2019/02.html][Emacs Community Update - Sacha Chua]]                            (10m)
    - [ ] [[https://media.emacsconf.org/2019/12.html][Ledger-mode - Quiliro Ordóñez]]                                  (15m)
    - [ ] [[https://media.emacsconf.org/2019/14.html][Magit deep dive - Jonathan Chu]]                                 (50m)
    - [ ] [[https://media.emacsconf.org/2019/19.html][How Emacs became my awesome Java editing environment -
      Torstein Krause Johansen]]                                           (15m)
    - [ ] [[https://media.emacsconf.org/2019/20.html][Automate your workflow as a game developer - Jānis Mancēvičs]]   (10m)
    - [ ] [[https://media.emacsconf.org/2019/22.html][Packaging emacs packages for Debian - David Bremner]]            (10m)
    - [ ] [[https://media.emacsconf.org/2019/24.html][GNU Emacs as software freedom in practice - Greg Farough]]       (25m)
    - [ ] [[https://media.emacsconf.org/2019/26.html][Emacs: The Editor for the Next Forty Years - Perry
      E. Metzger]]                                                         (65m)
    - [ ] [[https://media.emacsconf.org/2019/27.html][How to record executable notes with eev - and how to play
      them back - Eduardo Ochs]]                                           (20m)
    - [ ] [[https://media.emacsconf.org/2019/28.html][Play and control your music with Emacs - Damien Cassou]]         (10m)
    - [ ] [[https://media.emacsconf.org/2019/29.html][Restclient and org-mode for Api Documentation and Testing -
      Mackenzie Bligh]]                                                    (10m)
    - [ ] [[https://media.emacsconf.org/2019/30.html][Equake mode - Ben Slade]]                                        (10m)
    - [ ] [[https://media.emacsconf.org/2019/31.html][Don't wait! Write your own (yas)snippet - Tony Aldon]]           (10m)
    - [ ] [[https://media.emacsconf.org/2019/32.html][VSCode is Better than Emacs - Zaiste]]                           (10m)
*** Write blog post about EmacsConf 2019
    :PROPERTIES:
    :ESTIMATED: 5.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1575286599
    :TASKID:   WRITE.1575286599
    :END:

** kurianbenoy
*** IN_PROGRESS Deep Learning with Pytorch [1/4]
    :PROPERTIES:
    :ESTIMATED: 12
    :ACTUAL:   2.50
    :OWNER: kurianbenoy
    :ID: READ.1575047741
    :TASKID: READ.1575047741
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-01 Sun 12:00]--[2019-12-01 Sun 13:00] =>  1:00
    CLOCK: [2019-11-30 Sat 08:00]--[2019-11-30 Sat 09:30] =>  1:30
    :END:
     - [X] Chapter2: It starts with a Tensor                 (2h)
     - [ ] Chapter 3: Real World representation with Tensors (3h)
     - [ ] Chapter 4: Mechanism of Learning                  (5h)
     - [ ] Chapter 5: Using a NN to fit data                 (2h)
*** IN_PROGRESS READ CTCI  [0/4]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   3.75
    :OWNER: kurianbenoy
    :ID: READ.1575048222
    :TASKID: READ.1575048222
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-04 Wed 16:00]--[2019-12-04 Wed 16:45] =>  0:45
    CLOCK: [2019-12-03 Tue 22:00]--[2019-12-03 Tue 23:00] =>  1:00
    CLOCK: [2019-12-02 Mon 16:00]--[2019-12-02 Mon 18:00] =>  2:00
    :END:
    - [ ] Trees and graphs                  (4h)
    - [ ] Dynamic progrmaming and recursion (4h)
*** Onboard GCI participants | Mentor work Part II
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: PROJECT.1575302444
    :TASKID: PROJECT.1575302444
    :END:
    - [ ] Understand Swift4TF codebase, first PR (4h)
    - [ ] Help GCI participants                  (4h)
** sandeepk
*** Fluent Python Part II [/1]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1573385682
    :TASKID: READ.1573385682
    :END:
    - [ ] Chapter-6  Design Patterns with First-Class Functions (6h)
*** IN_PROGRESS Data Structure Part II [/3]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   0.33
    :OWNER: sandeepk
    :ID: READ.1573385745
    :TASKID: READ.1573385745
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-02 Mon 09:50]--[2019-12-02 Mon 10:10] =>  0:20
    :END:
    - [ ] Linked List        (2h)
    - [ ] Stacks and Queues  (3h)
    - [ ] Backtracking       (4h)
*** IN_PROGRESS Project Billion [2/3]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.83
    :OWNER: sandeepk
    :ID: OPS.1574962798
    :TASKID: OPS.1574962798
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-30 Sat 18:00]--[2019-11-30 Sat 19:00] =>  1:00
    CLOCK: [2019-11-29 Fri 20:50]--[2019-11-29 Fri 21:10] =>  0:20
    CLOCK: [2019-11-28 Thu 20:00]--[2019-11-28 Thu 20:30] =>  0:30
    :END:
    - [X] GCP Instance Creation, App deployment and Database Setup.  (1h)
    - [X] Remote Connection Setup for Database.                      (30m)
    - [ ] Cron job setup for Database update and event notification. (30m)
